MyMovies/app/controllers/movies_controller.rb

SELECT * FROM "movies"
---
  def index
    @movies = Movie.all

SELECT * FROM "movies" WHERE ("movies"."id" = 1)
---
  def show
    @movie = Movie.find(params[:id])

SELECT * FROM "movies" WHERE ("movies"."id" = 1)
---
  def edit
    @movie = Movie.find(params[:id])

INSERT INTO "movies" ("rating", "created_at", "updated_at", "user_id", "title") VALUES(3, '2016-05-17 07:31:16', '2016-05-17 07:31:16', NULL, 'sadad')
---
  def create
    @movie = Movie.new(params[:movie])
       respond_to do |format|
      if @movie.save

SELECT * FROM "movies" WHERE ("movies"."id" = 2)
---
  def update
    @movie = Movie.find(params[:id])

SELECT * FROM "movies" WHERE ("movies"."id" = 1)
DELETE FROM "movies" WHERE "id" = 1
---
  def destroy
    @movie = Movie.find(params[:id])
    @movie.destroy