Mymovie/app/controllers/mymovies_controller.rb

SELECT * FROM "mymovies"
---
  def index
    @mymovies = Mymovie.all

SELECT * FROM "mymovies" WHERE ("mymovies"."id" = 1)
---
  def show
    @mymovie = Mymovie.find(params[:id])

INSERT INTO "mymovies" ("updated_at", "Title", "created_at", "Rating") VALUES('2016-05-17 15:17:53', 'theri', '2016-05-17 15:17:53', 4)
---
  def create
    @mymovie = Mymovie.new(params[:mymovie])

    respond_to do |format|
      if @mymovie.save

SELECT * FROM "mymovies" WHERE ("mymovies"."id" = 3)
DELETE FROM "mymovies" WHERE "id" = 3
---
  def destroy
    @mymovie = Mymovie.find(params[:id])
    @mymovie.destroy