blog/app/controllers/articles_controller.rb

SELECT `articles`.* FROM `articles`
---
   def index
 @article = Article.all

INSERT INTO `articles` (`title`, `text`, `created_at`, `updated_at`) VALUES ('hai how r u', 'very bad', '2016-05-29 06:36:36', '2016-05-29 06:36:36')
---
  def create
 @article = Article.new(article_params)
  if @article.save

SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 20 LIMIT 1
UPDATE `articles` SET `text` = 'very gud', `updated_at` = '2016-05-29 08:24:13' WHERE `articles`.`id` = 20
---
 def update
  @article =Article.find(params[:id])
 if @article.update(article_params)

SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 1 LIMIT 1
DELETE FROM `articles` WHERE `articles`.`id` = 1
---
 def destroy
    @article = Article.find(params[:id])
   @article.destroy