blog/app/controllers/comments_controller.rb

SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 20 LIMIT 1
INSERT INTO `comments` (`commenter`, `body`, `article_id`, `created_at`, `updated_at`) VALUES ('waste dude', 'yes yes!', 20, '2016-05-29 08:24:57', '2016-05-29 08:24:57')
---
def create
    @article = Article.find(params[:article_id])
    @comment = @article.comments.create(comment_params)